src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>НаОплату</name>
  </enumValues>
  <enumValues>
    <name>ЧастичнаяОплата</name>
  </enumValues>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КатегорииОпераций/КатегорииОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииОпераций</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>800</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Внутренний</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СвязьПоТипу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСубконто</name>
      <comment>Номер субконто связанного по типу</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретРедактирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретРедактированияИзДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Необязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Условия</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сравнение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроводки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНалоговой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутренняяОрганизация</name>
    <comment>Организация-дубль контрагента</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИностранныйКонтрагент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеятельностьПрекращена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/РаботаСЗаявкамиКлиентСервер/Module.bsl
&НаКлиенте
Функция ПолучитьИнформациюОЗаявкахЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	ТекстЗапроса = "exec sp_get_requests_BUDGET_99
	| @d_begin 		 = '" + Формат(ДатаНачала, "ДФ = ггггММдд") + "',
	| @d_end 		 = '" + Формат(ДатаОкончания + 86400, "ДФ = ггггММдд") + "',
	| @s_division	 = 'All'";
	
	СоединениеАДО = ЗапросыЧерезАДО.ПолучитьСоединениеАДО("Fin_Request");
	Возврат(РаботаСЗаявкамиКлиентСервер.РазобратьСтруктуруЗаявокSQL(ЗапросыЧерезАДО.ВыполнитьЗапросАДО(СоединениеАДО, ТекстЗапроса)));
	
КонецФункции

&НаСервере
Функция ПолучитьИнформациюОЗаявкахПоСписку(СписокЗаявок = "") Экспорт

	ТекстЗапроса = "exec sp_get_requests_BUDGET_CatOp_99
	| @s_numbers_list = '" + СписокЗаявок + "',
    | @s_filter = 'single',
    | @b_all = 1";
	
	СоединениеАДО = ЗапросыЧерезАДО.ПолучитьСоединениеАДО("Fin_Request");	
	Возврат(РаботаСЗаявкамиКлиентСервер.РазобратьСтруктуруЗаявокSQL(ЗапросыЧерезАДО.ВыполнитьЗапросАДО(СоединениеАДО, ТекстЗапроса)));
	
КонецФункции

&НаСервере
Функция ПолучитьИнформациюОЗаявкахПоМассивуЗаявок(МассивЗаявок) Экспорт

	СписокЗаявок = "";
	Для Каждого Элемент Из МассивЗаявок Цикл
		
		Если СписокЗаявок = "" Тогда
			СписокЗаявок = Элемент;
		Иначе
			СписокЗаявок = СписокЗаявок + "," + Элемент;
		КонецЕсли;
		
	КонецЦикла;

	Возврат РаботаСЗаявкамиКлиентСервер.ПолучитьИнформациюОЗаявкахПоСписку(СписокЗаявок);
	
КонецФункции


&НаСервере
Функция РазобратьПоляЗаявкиSQL(ДанныеSQL) Экспорт
	
	СтруктураДанных = Новый Структура();
	
	КатегорияОперации = Справочники.КатегорииОпераций.НайтиПоКоду(СокрЛП(ДанныеSQL.codeKatOper));
	
	Если НЕ ЗначениеЗаполнено(КатегорияОперации) Тогда
		
		сообЦУМ = "";
		
		Если ДанныеSQL.IDBrand = "80000726" ИЛИ ДанныеSQL.IDBrand = "80001149" Тогда
			сообЦУМ = " ЦУМ";
		КонецЕсли;
		
		Сообщить("Для Заявки №"+ СокрЛП(ДанныеSQL.NumberRequest) + " от "+
			ДанныеSQL.DateRequest + " не найдена категория операции" + сообЦУМ + "! (Значение в системе заявок = '"+ СокрЛП(ДанныеSQL.codeKatOper) + "')");
			//Символы.ПС+"Заявка не будет загружена!",СтатусСообщения.Важное);
		
	КонецЕсли;
	
	НазначениеПлатежа = СокрЛП(ДанныеSQL.objPay);
	ДополнительнаяИнформация = СокрЛП(ДанныеSQL.S_DOC_INFO); 
	НазначениеПлатежа = СокрЛП(ДанныеSQL.objPay) + ?(НЕ(НазначениеПлатежа = "" И ДополнительнаяИнформация = ""),"); ","") + ДополнительнаяИнформация;
	
	СтруктураДанных.Вставить("IDЗаявки",				СокрЛП(ДанныеSQL.IDRequest));
	СтруктураДанных.Вставить("НомерЗаявки",				СокрЛП(ДанныеSQL.NumberRequest));
	СтруктураДанных.Вставить("НачальнаяБаза",			ДанныеSQL.startBase);
	СтруктураДанных.Вставить("ДатаЗаявки",				ДанныеSQL.DateRequest);
	СтруктураДанных.Вставить("Казначейство",			ДанныеSQL.nomkazn);
	СтруктураДанных.Вставить("Сумма",					ДанныеSQL.Amount);		//// + Окр(ДанныеSQL.Amount*ДанныеSQL.percentPay/100,2));	//
	СтруктураДанных.Вставить("СуммаНДС",				ДанныеSQL.AmountNDS);
	СтруктураДанных.Вставить("ВалютаЗаявки",			Справочники.Валюты.НайтиПоКоду(СокрЛП(ДанныеSQL.codeCurr)));
	СтруктураДанных.Вставить("Валюта",					Справочники.Валюты.НайтиПоКоду(СокрЛП(ДанныеSQL.codeCurrPay)));
	СтруктураДанных.Вставить("Процент",					ДанныеSQL.percentPay);
	СтруктураДанных.Вставить("КурсОплатыФиксированный", ДанныеSQL.fixExchPay);
	СтруктураДанных.Вставить("НазначениеПлатежа", 		НазначениеПлатежа);
	СтруктураДанных.Вставить("КатегорияОперации", 		Справочники.КатегорииОпераций.НайтиПоКоду(СокрЛП(ДанныеSQL.codeKatOper)));
	СтруктураДанных.Вставить("ДолжностьАвтора",			СокрЛП(ДанныеSQL.position));
	СтруктураДанных.Вставить("ЦФУ",						Справочники.ЦФУ.НайтиПоКоду(СокрЛП(ДанныеSQL.codeCFU)));
	СтруктураДанных.Вставить("Бренд",					Справочники.Брэнды.НайтиПоКоду(СокрЛП(ДанныеSQL.codeBrand)));
	СтруктураДанных.Вставить("Комментарий",				СокрЛП(ДанныеSQL.comment));
	СтруктураДанных.Вставить("Автор",					СокрЛП(ДанныеSQL.Who));
	СтруктураДанных.Вставить("СтатусЗаявки",			Перечисления.СтатусыЗаявок.Новый);
	СтруктураДанных.Вставить("Сводная",					Булево(ДанныеSQL.hasChildren));
	
	СтруктураДанных.Вставить("УправленческийУчет", Новый Массив);

	// Заполняем из Категории
	ДанныеУУ = УправленческийУчетСервер.ПодготовитьДанныеУправленческогоУчета(СтруктураДанных.КатегорияОперации);
	
	Для Каждого СтрокаПараметры Из ДанныеУУ Цикл		
		НоваяСтрокаУУ = Новый Структура("Имя, Значение, ТипРеквизита, ЗапретРедактирования, Необязательный, ВидПараметра, Формула");
		ЗаполнитьЗначенияСвойств(НоваяСтрокаУУ, СтрокаПараметры);
		СтруктураДанных.УправленческийУчет.Добавить(НоваяСтрокаУУ);
	КонецЦикла;
	
	//заполняем субконто
	Для т = 0 по 8 Цикл
		
		Параметр = ДанныеSQL["Параметр" + т];
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			
			ФорматПараметра = ДанныеSQL["ФорматПараметра" + т];
			ЗначениеПараметра = ДанныеSQL["s_sub" + (т + 1)];
			
			// Поиск Строки УУ
			
			Для Каждого СтрокаОбработки Из СтруктураДанных.УправленческийУчет Цикл
				
				Если СтрокаОбработки.Имя = "ЦФУ" Тогда
					СтрокаОбработки.Значение = СтруктураДанных.ЦФУ;
					Продолжить;
				КонецЕсли;
				
				Если СтрокаОбработки.Имя = "Бренд" Тогда
					СтрокаОбработки.Значение = СтруктураДанных.Бренд;
					Продолжить;
				КонецЕсли;
				
				Если СтрокаОбработки.Имя <> Параметр Тогда
					Продолжить;
				КонецЕсли;

				Если СтрокаОбработки.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникЦФУ
					ИЛИ СтрокаОбработки.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникБрэнды Тогда
					
					Продолжить;
					
				ИначеЕсли СтрокаОбработки.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникКонтрагенты Тогда
					СтрокаОбработки.Значение = Справочники.Контрагенты.НайтиПоКоду(ЗначениеПараметра);
					
				ИначеЕсли СтрокаОбработки.ВидПараметра <> Неопределено И  СтрокаОбработки.ВидПараметра.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСубконтоУправленческогоУчета") Тогда
					СтрокаОбработки.Значение = Справочники.ЗначенияСубконтоУправленческогоУчета.НайтиПоКоду(ЗначениеПараметра,,, СтрокаОбработки.ВидПараметра);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого СтрокаУУ Из СтруктураДанных.УправленческийУчет Цикл
				
				Если ТипЗнч(СтрокаУУ.ВидПараметра) = Тип("ПланВидовХарактеристикСсылка.РеквизитыУправленческогоУчета")
					И СтрокаУУ.ВидПараметра.НаименованиеПараметра = ФорматПараметра Тогда
					
					СтрокаУУ.Значение = Справочники.ЗначенияСубконтоУправленческогоУчета.НайтиПоКоду(ЗначениеПараметра,,, СтрокаУУ.ВидПараметра);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервере
Функция РазобратьСтруктуруЗаявокSQL(ДанныеSQL) Экспорт
	
	МассивДанных = Новый Массив;
	
	Для Каждого СтрокаДанных Из ДанныеSQL Цикл
		
		МассивДанных.Добавить(РаботаСЗаявкамиКлиентСервер.РазобратьПоляЗаявкиSQL(СтрокаДанных));
		
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции
